{
    "Generic Statement": [
        "1.  What are the main ideas?",
        "2.  What facts / evidence are we presented with?",
        "3.  What questions are being asked?",
        "4.  What can you use this knowledge to do?",
        "5.  How can you test your conclusions are correct?",
        "6.  Why do we need to know this?",
        "7.  Why does this happen / why does it work?",
        "8.  What are the underlying causes / processes?",
        "9.  How does this connect to previous learning?",
        "10. Which aspects are the most important / do you most agree with?",
        "11. What assumptions are you making?",
        "12. How can you verify this concept / opinion is accurate?",
        "13. Is there another possible conclusion?",
        "14. Now we know this, what else might we infer?",
        "15. What does this suggest is worth investigating next?",
        "16. What are you trying to accomplish here?",
        "17. How can you improve your approach?",
        "18. What questions are you not asking that you should be?"
    ],
    "Sciences and Mathematics": [
        "1.  What are the key concepts or theories?",
        "2.  What data or experimental results are provided?",
        "3.  What hypotheses or research questions are being explored?",
        "4.  How can these findings be applied in scientific contexts?",
        "5.  What experiments or proofs can validate your conclusions?",
        "6.  What is the significance of this discovery in the field?",
        "7.  What are the underlying principles or mechanisms?",
        "8.  What fundamental laws govern this behaviour?",
        "9.  How does this concept build upon existing theories?",
        "10. Which findings are most significant?",
        "11. What initial conditions or approximations are considered?",
        "12. What calculations or experiments can confirm your hypothesis?",
        "13. Are there alternative theories that explain the data?",
        "14. What further predictions can be made based on these results?",
        "15. What subsequent experiments should be conducted?",
        "16. What is the objective of this research?",
        "17. How can you refine your methodology or calculations?",
        "18. What variables or factors have you overlooked?"
    ],
    "Arts and Creative Studies": [
        "1.  What are the primary artistic themes or techniques?",
        "2.  What visual or auditory elements support the work?",
        "3.  What artistic questions or expressions are being conveyed?",
        "4.  How can these techniques influence your creative work?",
        "5.  How can critiques or feedback refine your work?",
        "6.  What is the relevance of this style in contemporary art?",
        "7.  What artistic choices create this effect?",
        "8.  What techniques are foundational to this work?",
        "9.  How does this piece relate to other works or movements?",
        "10. Which elements of the work do you find most impactful?",
        "11. What stylistic choices are influencing your work?",
        "12. How can practice or experimentation validate your techniques?",
        "13. Could different techniques convey the message better?",
        "14. What new creative directions does this open up?",
        "15. What new techniques should be explored?",
        "16. What is the intention behind your artistic expression?",
        "17. How can you develop your artistic skills further?",
        "18. What unexplored themes could enrich your work?"
    ],
    "Humanities": [
        "1.  What are the central themes or arguments?",
        "2.  What textual evidence or historical facts are presented?",
        "3.  What literary or philosophical questions are being raised?",
        "4.  How does this understanding enhance your interpretation?",
        "5.  How can additional analysis confirm your interpretation?",
        "6.  How does this impact our understanding of culture or history?",
        "7.  What cultural or historical factors contribute to this?",
        "8.  What deeper meanings or contexts inform this narrative?",
        "9.  How does this relate to prior literature or events?",
        "10. Which interpretations resonate most with you?",
        "11. What biases are influencing your interpretation?",
        "12. How can cross-referencing sources support your view?",
        "13. Can the text or event be interpreted differently?",
        "14. What broader implications does this analysis have?",
        "15. What other texts or periods could be examined?",
        "16. What is the aim of your analysis or critique?",
        "17. How can you enhance your interpretive strategies?",
        "18. What alternative readings are you missing?"
    ],
    "Languages": [
        "1. What new words or expressions are being introduced?",
        "2. Which contexts or registers require different language choices?",
        "3. Which grammatical structures underpin meaning here?",
        "4. How can repeated reading, writing, and speaking strengthen fluency?",
        "5. How might role-play or exercises confirm your progress?",
        "6. Why is this language skill valuable for real-life communication?",
        "7. What patterns or rules influence usage in different situations?",
        "8. How does cultural insight deepen understanding of these expressions?",
        "9. How does this lesson build upon previous linguistic knowledge?",
        "10. Which aspects of the language feel most challenging to you?",
        "11. Which preconceptions might affect your approach to learning?",
        "12. How can you confirm your pronunciation or usage is correct?",
        "13. Are there other possible translations or interpretations?",
        "14. Given this vocabulary, what further meaning can be inferred?",
        "15. What next steps or areas of practice will improve your skills?",
        "16. What is the aim of communicating in this language?",
        "17. How can you refine your language-learning strategy?",
        "18. What gaps in knowledge or usage should you address next?"
    ],
    "Social Sciences": [
        "1.  What are the core issues or perspectives?",
        "2.  What statistical data or case studies are given?",
        "3.  What societal issues or debates are being addressed?",
        "4.  How can this information inform policy or social change?",
        "5.  What research methods or data can verify your conclusions?",
        "6.  How does this information affect our understanding of society?",
        "7.  What social or economic factors explain this phenomenon?",
        "8.  What root causes are influencing this situation?",
        "9.  How does this idea relate to previous social theories?",
        "10. Which arguments do you find most compelling?",
        "11. What ideological frameworks are you applying?",
        "12. What evidence can substantiate your claims?",
        "13. Are there other perspectives that challenge this viewpoint?",
        "14. How might this understanding influence future trends?",
        "15. What additional issues merit examination?",
        "16. What is the goal of this policy proposal or study?",
        "17. How can you strengthen your argument or methods?",
        "18. What counterarguments need consideration?"
    ]
}